qmk/qmk_firmware/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32L0/stm32l0xx_hal_flash_ex.h
/** @defgroup FLASHEx_Type_Erase FLASHEx_Type_Erase
  * @{
  */  
#define FLASH_TYPEERASE_PAGES       ((uint32_t)0x00)  /*!< Page erase only */
/**
  * @}
  */

/** @defgroup FLASHEx_Option_Type FLASHEx Option Type
  * @{
  */
#define OPTIONBYTE_WRP        ((uint32_t)0x01)  /*!< WRP option byte configuration */
#define OPTIONBYTE_RDP        ((uint32_t)0x02)  /*!< RDP option byte configuration */
#define OPTIONBYTE_USER       ((uint32_t)0x04)  /*!< USER option byte configuration */
#define OPTIONBYTE_BOR        ((uint32_t)0x08)  /*!< BOR option byte configuration */
#define OPTIONBYTE_BOOT_BIT1  ((uint32_t)0x10)  /*!< BOOT PIN1 option byte configuration*/
/**
  * @}
  */

/** @defgroup FLASHEx_WRP_State FLASHEx WRP State
  * @{
  */
#define OB_WRPSTATE_DISABLE      ((uint32_t)0x00)  /*!< Disable the write protection of the desired sectors */
#define OB_WRPSTATE_ENABLE       ((uint32_t)0x01)  /*!< Enable the write protection of the desired sectors */
/**
  * @}
  */

/** @defgroup FLASHEx_Option_Bytes_ReadWrite_Mask FLASHEx Option Bytes Write Mask
  * @{
  */ 
#define WRP_MASK_LOW          ((uint32_t)0x0000FFFF)
#define WRP_MASK_HIGH         ((uint32_t)0xFFFF0000)
/**
  * @}
  */

#if defined (STM32L031xx) || defined (STM32L041xx) 
/** @defgroup FLASHEx_Option_Bytes_Write_Protection FLASHEx Option Bytes Write Protection
  * @{
  */
#define OB_WRP_Pages0to31          ((uint32_t)0x00000001) /* Write protection of Sector0 */
#define OB_WRP_Pages32to63         ((uint32_t)0x00000002) /* Write protection of Sector1 */
#define OB_WRP_Pages64to95         ((uint32_t)0x00000004) /* Write protection of Sector2 */
#define OB_WRP_Pages96to127        ((uint32_t)0x00000008) /* Write protection of Sector3 */
#define OB_WRP_Pages128to159       ((uint32_t)0x00000010) /* Write protection of Sector4 */
#define OB_WRP_Pages160to191       ((uint32_t)0x00000020) /* Write protection of Sector5 */
#define OB_WRP_Pages192to223       ((uint32_t)0x00000040) /* Write protection of Sector6 */
#define OB_WRP_Pages224to255       ((uint32_t)0x00000080) /* Write protection of Sector7 */
#define OB_WRP_AllPages            ((uint32_t)0x000000FF) /*!< Write protection of all Sectors */
/**
  * @}
  */
#elif defined (STM32L051xx) || defined (STM32L052xx) || defined (STM32L053xx) || defined (STM32L061xx) || defined (STM32L062xx) || defined (STM32L063xx)
/** @defgroup FLASHEx_Option_Bytes_Write_Protection FLASHEx Option Bytes Write Protection
  * @{
  */
#define OB_WRP_Pages0to31          ((uint32_t)0x00000001) /* Write protection of Sector0 */
#define OB_WRP_Pages32to63         ((uint32_t)0x00000002) /* Write protection of Sector1 */
#define OB_WRP_Pages64to95         ((uint32_t)0x00000004) /* Write protection of Sector2 */
#define OB_WRP_Pages96to127        ((uint32_t)0x00000008) /* Write protection of Sector3 */
#define OB_WRP_Pages128to159       ((uint32_t)0x00000010) /* Write protection of Sector4 */
#define OB_WRP_Pages160to191       ((uint32_t)0x00000020) /* Write protection of Sector5 */
#define OB_WRP_Pages192to223       ((uint32_t)0x00000040) /* Write protection of Sector6 */
#define OB_WRP_Pages224to255       ((uint32_t)0x00000080) /* Write protection of Sector7 */
#define OB_WRP_Pages256to287       ((uint32_t)0x00000100) /* Write protection of Sector8 */
#define OB_WRP_Pages288to319       ((uint32_t)0x00000200) /* Write protection of Sector9 */
#define OB_WRP_Pages320to351       ((uint32_t)0x00000400) /* Write protection of Sector10 */
#define OB_WRP_Pages352to383       ((uint32_t)0x00000800) /* Write protection of Sector11 */
#define OB_WRP_Pages384to415       ((uint32_t)0x00001000) /* Write protection of Sector12 */
#define OB_WRP_Pages416to447       ((uint32_t)0x00002000) /* Write protection of Sector13 */
#define OB_WRP_Pages448to479       ((uint32_t)0x00004000) /* Write protection of Sector14 */
#define OB_WRP_Pages480to511       ((uint32_t)0x00008000) /* Write protection of Sector15 */
#define OB_WRP_AllPages            ((uint32_t)0x0000FFFF) /*!< Write protection of all Sectors */
/**
  * @}
  */

#elif defined (STM32L071xx) || defined (STM32L072xx) || defined (STM32L073xx) || defined (STM32L081xx) || defined (STM32L082xx) || defined (STM32L083xx)
/** @defgroup FLASHEx_Option_Bytes_Write_Protection FLASHEx Option Bytes Write ProtectionP
  * @{
  */
#define OB_WRP_Pages0to31          ((uint32_t)0x00000001) /* Write protection of Sector0 */
#define OB_WRP_Pages32to63         ((uint32_t)0x00000002) /* Write protection of Sector1 */
#define OB_WRP_Pages64to95         ((uint32_t)0x00000004) /* Write protection of Sector2 */
#define OB_WRP_Pages96to127        ((uint32_t)0x00000008) /* Write protection of Sector3 */
#define OB_WRP_Pages128to159       ((uint32_t)0x00000010) /* Write protection of Sector4 */
#define OB_WRP_Pages160to191       ((uint32_t)0x00000020) /* Write protection of Sector5 */
#define OB_WRP_Pages192to223       ((uint32_t)0x00000040) /* Write protection of Sector6 */
#define OB_WRP_Pages224to255       ((uint32_t)0x00000080) /* Write protection of Sector7 */
#define OB_WRP_Pages256to287       ((uint32_t)0x00000100) /* Write protection of Sector8 */
#define OB_WRP_Pages288to319       ((uint32_t)0x00000200) /* Write protection of Sector9 */
#define OB_WRP_Pages320to351       ((uint32_t)0x00000400) /* Write protection of Sector10 */
#define OB_WRP_Pages352to383       ((uint32_t)0x00000800) /* Write protection of Sector11 */
#define OB_WRP_Pages384to415       ((uint32_t)0x00001000) /* Write protection of Sector12 */
#define OB_WRP_Pages416to447       ((uint32_t)0x00002000) /* Write protection of Sector13 */
#define OB_WRP_Pages448to479       ((uint32_t)0x00004000) /* Write protection of Sector14 */
#define OB_WRP_Pages480to511       ((uint32_t)0x00008000) /* Write protection of Sector15 */
#define OB_WRP_Pages512to543       ((uint32_t)0x00010000) /* Write protection of Sector16 */
#define OB_WRP_Pages544to575       ((uint32_t)0x00020000) /* Write protection of Sector17 */
#define OB_WRP_Pages576to607       ((uint32_t)0x00040000) /* Write protection of Sector18 */
#define OB_WRP_Pages608to639       ((uint32_t)0x00080000) /* Write protection of Sector19 */
#define OB_WRP_Pages640to671       ((uint32_t)0x00100000) /* Write protection of Sector20 */
#define OB_WRP_Pages672to703       ((uint32_t)0x00200000) /* Write protection of Sector21 */
#define OB_WRP_Pages704to735       ((uint32_t)0x00400000) /* Write protection of Sector22 */
#define OB_WRP_Pages736to767       ((uint32_t)0x00800000) /* Write protection of Sector23 */
#define OB_WRP_Pages768to799       ((uint32_t)0x01000000) /* Write protection of Sector24 */
#define OB_WRP_Pages800to831       ((uint32_t)0x02000000) /* Write protection of Sector25 */
#define OB_WRP_Pages832to863       ((uint32_t)0x04000000) /* Write protection of Sector26 */
#define OB_WRP_Pages864to895       ((uint32_t)0x08000000) /* Write protection of Sector27 */
#define OB_WRP_Pages896to927       ((uint32_t)0x10000000) /* Write protection of Sector28 */
#define OB_WRP_Pages928to959       ((uint32_t)0x20000000) /* Write protection of Sector29 */
#define OB_WRP_Pages960to991       ((uint32_t)0x40000000) /* Write protection of Sector30 */
#define OB_WRP_Pages992to1023      ((uint32_t)0x80000000) /* Write protection of Sector31 */
#define OB_WRP_AllPages            ((uint32_t)0xFFFFFFFF) /*!<Write  protection of all Sectors */
/**
  * @}
  */

/** @defgroup FLASHEx_Option_Bytes_Write_Protection2 FLASHEx Option Bytes Write Protection
  * @{
  */
#define OB_WRP2_Pages1024to1055    ((uint32_t)0x00000001) /* Write protection of Sector32 */
#define OB_WRP2_Pages1056to1087    ((uint32_t)0x00000002) /* Write protection of Sector33 */
#define OB_WRP2_Pages1088to1119    ((uint32_t)0x00000004) /* Write protection of Sector34 */
#define OB_WRP2_Pages1120to1151    ((uint32_t)0x00000008) /* Write protection of Sector35 */
#define OB_WRP2_Pages1152to1183    ((uint32_t)0x00000010) /* Write protection of Sector36 */
#define OB_WRP2_Pages1184to1215    ((uint32_t)0x00000020) /* Write protection of Sector37 */
#define OB_WRP2_Pages1216to1247    ((uint32_t)0x00000040) /* Write protection of Sector38 */
#define OB_WRP2_Pages1248to1279    ((uint32_t)0x00000080) /* Write protection of Sector39 */
#define OB_WRP2_Pages1280to1311    ((uint32_t)0x00000100) /* Write protection of Sector40 */
#define OB_WRP2_Pages1312to1343    ((uint32_t)0x00000200) /* Write protection of Sector41 */
#define OB_WRP2_Pages1344to1375    ((uint32_t)0x00000400) /* Write protection of Sector42 */
#define OB_WRP2_Pages1376to1407    ((uint32_t)0x00000800) /* Write protection of Sector43 */
#define OB_WRP2_Pages1408to1439    ((uint32_t)0x00001000) /* Write protection of Sector44 */
#define OB_WRP2_Pages1440to1471    ((uint32_t)0x00002000) /* Write protection of Sector45 */
#define OB_WRP2_Pages1472to1503    ((uint32_t)0x00004000) /* Write protection of Sector46 */
#define OB_WRP2_Pages1504to1535    ((uint32_t)0x00008000) /* Write protection of Sector47 */
#define OB_WRP2_AllPages           ((uint32_t)0x0000FFFF) /*!< Write protection of all Sectors WRP2 */
/**
  * @}
  */
#endif /* STM32L071xx || STM32L072xx || (STM32L073xx) || (STM32L081xx) || (STM32L082xx) || (STM32L083xx) */ 

/** @defgroup FLASHEx_Option_Bytes_Read_Protection FLASHEx Option Bytes Read Protection
  * @{
  */ 
#define OB_RDP_LEVEL0         ((uint8_t)0xAA)
#define OB_RDP_LEVEL1         ((uint8_t)0xBB)
#define OB_RDP_LEVEL2         ((uint8_t)0xCC) /* Warning: When enabling read protection level 2 
                                                it is no more possible to go back to level 1 or 0 */
/**
  * @}
  */ 

